<?php

/**
 * A sample configuration file
 *
 * The variables below need to be filled out with environment specific data.
 *
 * @author  Jason Lengstorf <jason@lengstorf.com>
 * @author  Phil Leggetter <phil@leggetter.co.uk>
 */

//创建一个数组作为配置变量的容器
$_C = array();

//----------------------------------------------------------
// 主要配置
//----------------------------------------------------------

$_C['APP_TIMEZONE'] = 'US/Pacific';

//----------------------------------------------------------
// 数据库身份认证
//----------------------------------------------------------

$_C['DB_HOST'] = 'localhost';
$_C['DB_NAME'] = '';
$_C['DB_USER'] = '';
$_C['DB_PASS'] = '';

//----------------------------------------------------------
// 开启调试模式
//----------------------------------------------------------

$_C['DEBUG'] = TRUE;

//----------------------------------------------------------
// 将数组中的常量转换为真正的常量
//----------------------------------------------------------

foreach($_C as $constant=>$value){
	define($constant, $value);
}